function flip --description="Puts a flipping table emoticon in the clipboard. (╯°□°）╯︵ ┻━┻"
	# All credits go to http://japaneseemoticons.me/table-flipping-emoticons/
	# Thank you so much :)
	set icons "(╯°□°）╯︵ ┻━┻" "(ノಠ益ಠ)ノ彡┻━┻" "ʕノ•ᴥ•ʔノ ︵ ┻━┻" "(/¯◡ ‿ ◡)/¯ ~ ┻━┻" "(ノ-_-)ノ ~┻━┻" "(ﾉ；；)ﾉ~┻━┻" "(ﾉ-_-)ﾉ ~┻━┻ ☆`" "(ノ-_-)ノ・・・~~┻━┻" "(ノ-_-)ノ~┻━┻" "ノ￣□￣)ノ ~┻━┻" "(ﾉ ⊙曲ఠ)ﾉ彡┻━┻" "(ﾉ｀□´)ﾉ⌒┻━┻" "(ﾉ ๑´Д`๑)ﾉ彡┻━┻" "┻━┻ミ＼（≧ロ≦＼）" "(ﾉ￣□￣)ﾉ ~┻━┻" "（ノ♯｀△´）ノ~’┻━┻" "（ノT＿T)ノ ＾┻━┻" "(┛ಠДಠ)┛彡┻━┻" "(ノ°▽°)ノ︵┻━┻" "(ﾉ*’ω’*)ﾉ彡┻━┻" "‎(ﾉಥ益ಥ）ﾉ ┻━┻" "(╯’□’)╯︵ ┻━┻" "(ﾉಥДಥ)ﾉ︵┻━┻･/" "(._.) ~ ︵ ┻━┻" "┻━┻ ︵ ლ(⌒-⌒ლ)" "(ﾉ＾◡＾)ﾉ︵ ┻━┻" "(╯ຈل͜ຈ) ╯︵ ┻━┻" "(╯ ͝° ͜ʖ͡°)╯︵ ┻━┻" "(ﾉ≧∇≦)ﾉ ﾐ ┸━┸" "(ノ｀´)ノ ~┻━┻ ～" "ʕ ⊃･ ◡ ･ ʔ⊃︵┻━┻" "(┛❍ᴥ❍)┛彡┻━┻" "(ʘ∇ʘ)ク 彡 ┻━┻" "(╯ಠ_ರೃ)╯︵ ┻━┻" "(ﾉ｀◇´)ﾉ~┻━┻" "(╯ ･ ᗜ ･ )╯︵ ┻━┻"
	set rand (random 1 (count $icons))
	echo $icons[$rand]
	string trim $icons[$rand] | xclip -r
end